DWARF debug info
================

Contains section .debug_info (1467 bytes)
Contains section .debug_macinfo (1 bytes)
Contains section .debug_pubtypes (27353 bytes)
Contains section .debug_aranges (0 bytes)
Contains section .debug_abbrev (585 bytes)
Contains section .debug_line (743 bytes)
Contains section .debug_str (30051 bytes)
Contains section .debug_pubnames (3622 bytes)

.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp
	DW_AT_language	DW_FORM_data2
	DW_AT_name	DW_FORM_strp
	DW_AT_stmt_list	DW_FORM_sec_offset
	DW_AT_comp_dir	DW_FORM_strp
	DW_AT_GNU_pubnames	DW_FORM_flag_present

[2] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref4

[3] DW_TAG_structure_type	DW_CHILDREN_no
	DW_AT_containing_type	DW_FORM_ref4
	DW_AT_name	DW_FORM_strp
	DW_AT_byte_size	DW_FORM_data1
	DW_AT_alignment	DW_FORM_udata

[4] DW_TAG_pointer_type	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4
	DW_AT_name	DW_FORM_strp

[5] DW_TAG_namespace	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_strp

[6] DW_TAG_structure_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_strp
	DW_AT_byte_size	DW_FORM_data1
	DW_AT_alignment	DW_FORM_udata

[7] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref4
	DW_AT_alignment	DW_FORM_udata
	DW_AT_data_member_location	DW_FORM_data1

[8] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4
	DW_AT_name	DW_FORM_strp


	DW_AT_name	DW_FORM_strp
	DW_AT_byte_size	DW_FORM_data1
	DW_AT_alignment	DW_FORM_udata

[24] DW_TAG_variant	DW_CHILDREN_yes

[25] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref_addr
	DW_AT_name	DW_FORM_strp

[26] DW_TAG_namespace	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp

[27] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref_addr
	DW_AT_alignment	DW_FORM_udata
	DW_AT_data_member_location	DW_FORM_data1

[28] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref4
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data1
	DW_AT_linkage_name	DW_FORM_strp

[29] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref4
	DW_AT_external	DW_FORM_flag_present
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data1
	DW_AT_alignment	DW_FORM_udata
	DW_AT_linkage_name	DW_FORM_strp

[30] DW_TAG_member	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref_addr
	DW_AT_alignment	DW_FORM_udata
	DW_AT_data_member_location	DW_FORM_data1
	DW_AT_artificial	DW_FORM_flag_present

[31] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref4
	DW_AT_external	DW_FORM_flag_present
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data2
	DW_AT_linkage_name	DW_FORM_strp

[32] DW_TAG_variant	DW_CHILDREN_yes
	DW_AT_discr_value	DW_FORM_data4

[33] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref4
	DW_AT_alignment	DW_FORM_udata
	DW_AT_data_member_location	DW_FORM_data1
	DW_AT_artificial	DW_FORM_flag_present

[34] DW_TAG_array_type	DW_CHILDREN_yes
	DW_AT_type	DW_FORM_ref_addr

[35] DW_TAG_structure_type	DW_CHILDREN_no
	DW_AT_containing_type	DW_FORM_ref_addr
	DW_AT_name	DW_FORM_strp
	DW_AT_byte_size	DW_FORM_data1
	DW_AT_alignment	DW_FORM_udata

[36] DW_TAG_subrange_type	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4
	DW_AT_lower_bound	DW_FORM_data1
	DW_AT_count	DW_FORM_data2

[37] DW_TAG_subroutine_type	DW_CHILDREN_yes
	DW_AT_type	DW_FORM_ref4

[38] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[39] DW_TAG_subroutine_type	DW_CHILDREN_yes

[40] DW_TAG_subroutine_type	DW_CHILDREN_yes
	DW_AT_type	DW_FORM_ref_addr

[41] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref4
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data2
	DW_AT_linkage_name	DW_FORM_strp

[42] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref_addr
	DW_AT_alignment	DW_FORM_udata
	DW_AT_data_member_location	DW_FORM_data1
	DW_AT_artificial	DW_FORM_flag_present

[43] DW_TAG_variant_part	DW_CHILDREN_no

[44] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref_addr
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data2
	DW_AT_alignment	DW_FORM_udata
	DW_AT_linkage_name	DW_FORM_strp

[45] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref4
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data1
	DW_AT_alignment	DW_FORM_udata
	DW_AT_linkage_name	DW_FORM_strp

[46] DW_TAG_structure_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_strp
	DW_AT_byte_size	DW_FORM_data2
	DW_AT_alignment	DW_FORM_udata

[47] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref4
	DW_AT_alignment	DW_FORM_udata
	DW_AT_data_member_location	DW_FORM_data2

[48] DW_TAG_variant_part	DW_CHILDREN_yes

[49] DW_TAG_enumerator	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_const_value	DW_FORM_sdata

[50] DW_TAG_subrange_type	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4
	DW_AT_lower_bound	DW_FORM_data1

[51] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref_addr

[52] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref_addr
	DW_AT_alignment	DW_FORM_udata
	DW_AT_data_member_location	DW_FORM_data2


.debug_info contents:
0x00000000: Compile Unit: length = 0x000005b7 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x000005bb)

0x0000000b: DW_TAG_compile_unit [1] *
              DW_AT_producer [DW_FORM_strp]	( .debug_str[0x00000000] = "clang LLVM (rustc version 1.41.1 (f3e1a954d 2020-02-24))")
              DW_AT_language [DW_FORM_data2]	(DW_LANG_Rust)
              DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000039] = "src/liballoc/lib.rs")
              DW_AT_stmt_list [DW_FORM_sec_offset]	(0x00000000)
              DW_AT_comp_dir [DW_FORM_strp]	( .debug_str[0x0000004d] = "/rustc/f3e1a954d2ead4e2fc197c7da7d71e6c61bad196/")
              DW_AT_GNU_pubnames [DW_FORM_flag_present]	(true)

0x0000001e:   DW_TAG_variable [2]  
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000007e] = "vtable")
                DW_AT_type [DW_FORM_ref4]	(cu + 0x0027 => {0x00000027} "vtable")

0x00000027:   DW_TAG_structure_type [3]  
                DW_AT_containing_type [DW_FORM_ref4]	(cu + 0x0032 => {0x00000032})
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000007e] = "vtable")
                DW_AT_byte_size [DW_FORM_data1]	(0x00)
                DW_AT_alignment [DW_FORM_udata]	(4)

0x00000032:   DW_TAG_pointer_type [4]  
                DW_AT_type [DW_FORM_ref4]	(cu + 0x0045 => {0x00000045} "String")
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000013c] = "&mut alloc::string::String")

0x0000003b:   DW_TAG_namespace [5] *
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000085] = "alloc")

0x00000040:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000008b] = "string")

0x00000045:       DW_TAG_structure_type [6] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000135] = "String")
                    DW_AT_byte_size [DW_FORM_data1]	(0x0c)
                    DW_AT_alignment [DW_FORM_udata]	(4)

0x0000004c:         DW_TAG_member [7]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000092] = "vec")
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x005e => {0x0000005e} "Vec<u8>")
                      DW_AT_alignment [DW_FORM_udata]	(4)
                      DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000057:         NULL

0x00000058:       NULL

0x00000059:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000092] = "vec")

0x0000005e:       DW_TAG_structure_type [6] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000012d] = "Vec<u8>")
                    DW_AT_byte_size [DW_FORM_data1]	(0x0c)
                    DW_AT_alignment [DW_FORM_udata]	(4)

0x00000065:         DW_TAG_member [7]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000096] = "buf")
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x008b => {0x0000008b} "RawVec<u8, alloc::alloc::Global>")
                      DW_AT_alignment [DW_FORM_udata]	(4)
                      DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000070:         DW_TAG_member [7]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000129] = "len")
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x0491 => {0x00000491} "usize")
                      DW_AT_alignment [DW_FORM_udata]	(4)
                      DW_AT_data_member_location [DW_FORM_data1]	(0x08)

0x0000007b:         DW_TAG_template_type_parameter [8]  
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x048a => {0x0000048a} "u8")
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x00000084:         NULL

0x00000085:       NULL

0x00000086:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000009a] = "raw_vec")

0x0000008b:       DW_TAG_structure_type [6] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000108] = "RawVec<u8, alloc::alloc::Global>")
                    DW_AT_byte_size [DW_FORM_data1]	(0x08)
                    DW_AT_alignment [DW_FORM_udata]	(4)

0x00000092:         DW_TAG_member [7]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000a2] = "ptr")
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x01fa => {0x000001fa} "Unique<u8>")
                      DW_AT_alignment [DW_FORM_udata]	(4)
                      DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x0000009d:         DW_TAG_member [7]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000f3] = "cap")
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x0491 => {0x00000491} "usize")
                      DW_AT_alignment [DW_FORM_udata]	(4)
                      DW_AT_data_member_location [DW_FORM_data1]	(0x04)

0x000000a8:         DW_TAG_member [7]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000fd] = "a")
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x00cc => {0x000000cc} "Global")
                      DW_AT_alignment [DW_FORM_udata]	(1)
                      DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x000000b3:         DW_TAG_template_type_parameter [8]  
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x048a => {0x0000048a} "u8")
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x000000bc:         DW_TAG_template_type_parameter [8]  
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x00cc => {0x000000cc} "Global")
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000106] = "A")

0x000000c5:         NULL

0x000000c6:       NULL

0x000000c7:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000085] = "alloc")

0x000000cc:       DW_TAG_structure_type [9]  
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000ff] = "Global")
                    DW_AT_byte_size [DW_FORM_data1]	(0x00)
                    DW_AT_alignment [DW_FORM_udata]	(1)

0x000000d3:       NULL

0x000000d4:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000017c] = "collections")

0x000000d9:       DW_TAG_namespace [5] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000188] = "btree")

0x000000de:         DW_TAG_namespace [5] *
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000018e] = "node")

0x000000e3:           DW_TAG_variable [10]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000193] = "EMPTY_ROOT_NODE")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x00f2 => {0x000000f2} "NodeHeader<(), (), ()>")
                        DW_AT_external [DW_FORM_flag_present]	(true)
                        DW_AT_decl_file [DW_FORM_data1]	("/rustc/f3e1a954d2ead4e2fc197c7da7d71e6c61bad196/src/liballoc/collections/btree/node.rs")
                        DW_AT_decl_line [DW_FORM_data1]	(130)
                        DW_AT_linkage_name [DW_FORM_strp]	( .debug_str[0x00000423] = "_ZN5alloc11collections5btree4node15EMPTY_ROOT_NODE17heb2293ea0fba367cE")

0x000000f2:           DW_TAG_structure_type [6] *
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000040c] = "NodeHeader<(), (), ()>")
                        DW_AT_byte_size [DW_FORM_data1]	(0x08)
                        DW_AT_alignment [DW_FORM_udata]	(4)

0x000000f9:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001a3] = "parent")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x04ff => {0x000004ff} "*const alloc::collections::btree::node::InternalNode<(), ()>")
                          DW_AT_alignment [DW_FORM_udata]	(4)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000104:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001af] = "parent_idx")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x02f0 => {0x000002f0} "MaybeUninit<u16>")
                          DW_AT_alignment [DW_FORM_udata]	(2)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x04)

0x0000010f:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000129] = "len")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x0508 => {0x00000508} "u16")
                          DW_AT_alignment [DW_FORM_udata]	(2)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x06)

0x0000011a:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x000003fe] = "keys_start")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x0539 => {0x00000539} "()[0]")
                          DW_AT_alignment [DW_FORM_udata]	(1)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x08)

0x00000125:             DW_TAG_template_type_parameter [8]  
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000024c] = "K")

0x0000012e:             DW_TAG_template_type_parameter [8]  
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000024e] = "V")

0x00000137:             DW_TAG_template_type_parameter [8]  
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000409] = "K2")

0x00000140:             NULL

0x00000141:           DW_TAG_structure_type [6] *
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000003ac] = "InternalNode<(), ()>")
                        DW_AT_byte_size [DW_FORM_data1]	(0x38)
                        DW_AT_alignment [DW_FORM_udata]	(4)

0x00000148:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001aa] = "data")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x0171 => {0x00000171} "LeafNode<(), ()>")
                          DW_AT_alignment [DW_FORM_udata]	(4)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000153:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000261] = "edges")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x0523 => {0x00000523} "MaybeUninit<alloc::collections::btree::node::BoxedNode<(), ()>>[12]")
                          DW_AT_alignment [DW_FORM_udata]	(4)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x08)

0x0000015e:             DW_TAG_template_type_parameter [8]  
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000024c] = "K")

0x00000167:             DW_TAG_template_type_parameter [8]  
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000024e] = "V")

0x00000170:             NULL

0x00000171:           DW_TAG_structure_type [6] *
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000250] = "LeafNode<(), ()>")
                        DW_AT_byte_size [DW_FORM_data1]	(0x08)
                        DW_AT_alignment [DW_FORM_udata]	(4)

0x00000178:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001a3] = "parent")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x04ff => {0x000004ff} "*const alloc::collections::btree::node::InternalNode<(), ()>")
                          DW_AT_alignment [DW_FORM_udata]	(4)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000183:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001af] = "parent_idx")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x02f0 => {0x000002f0} "MaybeUninit<u16>")
                          DW_AT_alignment [DW_FORM_udata]	(2)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x04)

0x0000018e:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000129] = "len")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x0508 => {0x00000508} "u16")
                          DW_AT_alignment [DW_FORM_udata]	(2)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x06)

0x00000199:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000020d] = "keys")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x050f => {0x0000050f} "MaybeUninit<()>[11]")
                          DW_AT_alignment [DW_FORM_udata]	(1)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x08)

0x000001a4:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000247] = "vals")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x050f => {0x0000050f} "MaybeUninit<()>[11]")
                          DW_AT_alignment [DW_FORM_udata]	(1)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x08)

0x000001af:             DW_TAG_template_type_parameter [8]  
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000024c] = "K")

0x000001b8:             DW_TAG_template_type_parameter [8]  
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000024e] = "V")

0x000001c1:             NULL

0x000001c2:           DW_TAG_structure_type [6] *
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000319] = "BoxedNode<(), ()>")
                        DW_AT_byte_size [DW_FORM_data1]	(0x04)
                        DW_AT_alignment [DW_FORM_udata]	(4)

0x000001c9:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000a2] = "ptr")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x0221 => {0x00000221} "Unique<alloc::collections::btree::node::LeafNode<(), ()>>")
                          DW_AT_alignment [DW_FORM_udata]	(4)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x000001d4:             DW_TAG_template_type_parameter [8]  
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000024c] = "K")

0x000001dd:             DW_TAG_template_type_parameter [8]  
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000024e] = "V")

0x000001e6:             NULL

0x000001e7:           NULL

0x000001e8:         NULL

0x000001e9:       NULL

0x000001ea:     NULL

0x000001eb:   DW_TAG_namespace [5] *
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000a6] = "core")

0x000001f0:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000a2] = "ptr")

0x000001f5:       DW_TAG_namespace [5] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000ab] = "unique")

0x000001fa:         DW_TAG_structure_type [6] *
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000e8] = "Unique<u8>")
                      DW_AT_byte_size [DW_FORM_data1]	(0x04)
                      DW_AT_alignment [DW_FORM_udata]	(4)

0x00000201:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000b2] = "pointer")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x0481 => {0x00000481} "*const u8")
                        DW_AT_alignment [DW_FORM_udata]	(4)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x0000020c:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000c7] = "_marker")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x024f => {0x0000024f} "PhantomData<u8>")
                        DW_AT_alignment [DW_FORM_udata]	(1)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000217:           DW_TAG_template_type_parameter [8]  
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x048a => {0x0000048a} "u8")
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x00000220:           NULL

0x00000221:         DW_TAG_structure_type [6] *
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000002df] = "Unique<alloc::collections::btree::node::LeafNode<(), ()>>")
                      DW_AT_byte_size [DW_FORM_data1]	(0x04)
                      DW_AT_alignment [DW_FORM_udata]	(4)

0x00000228:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000b2] = "pointer")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x0530 => {0x00000530} "*const alloc::collections::btree::node::LeafNode<(), ()>")
                        DW_AT_alignment [DW_FORM_udata]	(4)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000233:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000c7] = "_marker")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x0260 => {0x00000260} "PhantomData<alloc::collections::btree::node::LeafNode<(), ()>>")
                        DW_AT_alignment [DW_FORM_udata]	(1)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x0000023e:           DW_TAG_template_type_parameter [8]  
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x0171 => {0x00000171} "LeafNode<(), ()>")
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x00000247:           NULL

0x00000248:         NULL

0x00000249:       NULL

0x0000024a:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000cf] = "marker")

0x0000024f:       DW_TAG_structure_type [6] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d8] = "PhantomData<u8>")
                    DW_AT_byte_size [DW_FORM_data1]	(0x00)
                    DW_AT_alignment [DW_FORM_udata]	(1)

0x00000256:         DW_TAG_template_type_parameter [8]  
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x048a => {0x0000048a} "u8")
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x0000025f:         NULL

0x00000260:       DW_TAG_structure_type [6] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x000002a0] = "PhantomData<alloc::collections::btree::node::LeafNode<(), ()>>")
                    DW_AT_byte_size [DW_FORM_data1]	(0x00)
                    DW_AT_alignment [DW_FORM_udata]	(1)

0x00000267:         DW_TAG_template_type_parameter [8]  
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x0171 => {0x00000171} "LeafNode<(), ()>")
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x00000270:         NULL

0x00000271:       NULL

0x00000272:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000015b] = "fmt")

0x00000277:       DW_TAG_structure_type [9]  
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000015f] = "Error")
                    DW_AT_byte_size [DW_FORM_data1]	(0x00)
                    DW_AT_alignment [DW_FORM_udata]	(1)

0x0000027e:       DW_TAG_namespace [5] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000052c] = "rt")

0x00000283:         DW_TAG_namespace [5] *
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000052f] = "v1")

0x00000288:           DW_TAG_enumeration_type [11] *
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x048a => {0x0000048a} "u8")
                        DW_AT_enum_class [DW_FORM_flag_present]	(true)
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000054c] = "Alignment")
                        DW_AT_byte_size [DW_FORM_data1]	(0x01)
                        DW_AT_alignment [DW_FORM_udata]	(1)

0x00000293:             DW_TAG_enumerator [12]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000532] = "Left")
                          DW_AT_const_value [DW_FORM_udata]	(0)

0x00000299:             DW_TAG_enumerator [12]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000537] = "Right")
                          DW_AT_const_value [DW_FORM_udata]	(1)

0x0000029f:             DW_TAG_enumerator [12]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000053d] = "Center")
                          DW_AT_const_value [DW_FORM_udata]	(2)

0x000002a5:             DW_TAG_enumerator [12]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000544] = "Unknown")
                          DW_AT_const_value [DW_FORM_udata]	(3)

0x000002ab:             NULL

0x000002ac:           NULL

0x000002ad:         NULL

0x000002ae:       NULL

0x000002af:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000085] = "alloc")

0x000002b4:       DW_TAG_structure_type [6] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000170] = "LayoutErr")
                    DW_AT_byte_size [DW_FORM_data1]	(0x00)
                    DW_AT_alignment [DW_FORM_udata]	(1)

0x000002bb:         DW_TAG_member [7]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000165] = "private")
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                      DW_AT_alignment [DW_FORM_udata]	(1)
                      DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x000002c6:         NULL

0x000002c7:       DW_TAG_structure_type [6] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000048c] = "Layout")
                    DW_AT_byte_size [DW_FORM_data1]	(0x08)
                    DW_AT_alignment [DW_FORM_udata]	(4)

0x000002ce:         DW_TAG_member [7]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000046a] = "size_")
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x0491 => {0x00000491} "usize")
                      DW_AT_alignment [DW_FORM_udata]	(4)
                      DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x000002d9:         DW_TAG_member [7]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000470] = "align_")
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x03c6 => {0x000003c6} "NonZeroUsize")
                      DW_AT_alignment [DW_FORM_udata]	(4)
                      DW_AT_data_member_location [DW_FORM_data1]	(0x04)

0x000002e4:         NULL

0x000002e5:       NULL

0x000002e6:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001ba] = "mem")

0x000002eb:       DW_TAG_namespace [5] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001be] = "maybe_uninit")

0x000002f0:         DW_TAG_union_type [13] *
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001fc] = "MaybeUninit<u16>")
                      DW_AT_byte_size [DW_FORM_data1]	(0x02)
                      DW_AT_alignment [DW_FORM_udata]	(2)

0x000002f7:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001cb] = "uninit")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                        DW_AT_alignment [DW_FORM_udata]	(1)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000302:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001d2] = "value")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x036b => {0x0000036b} "ManuallyDrop<u16>")
                        DW_AT_alignment [DW_FORM_udata]	(2)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x0000030d:           DW_TAG_template_type_parameter [8]  
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x0508 => {0x00000508} "u16")
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x00000316:           NULL

0x00000317:         DW_TAG_union_type [13] *
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000223] = "MaybeUninit<()>")
                      DW_AT_byte_size [DW_FORM_data1]	(0x00)
                      DW_AT_alignment [DW_FORM_udata]	(1)

0x0000031e:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001cb] = "uninit")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                        DW_AT_alignment [DW_FORM_udata]	(1)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000329:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001d2] = "value")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x0387 => {0x00000387} "ManuallyDrop<()>")
                        DW_AT_alignment [DW_FORM_udata]	(1)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000334:           DW_TAG_template_type_parameter [8]  
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x0000033d:           NULL

0x0000033e:         DW_TAG_union_type [13] *
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000036c] = "MaybeUninit<alloc::collections::btree::node::BoxedNode<(), ()>>")
                      DW_AT_byte_size [DW_FORM_data1]	(0x04)
                      DW_AT_alignment [DW_FORM_udata]	(4)

0x00000345:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001cb] = "uninit")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                        DW_AT_alignment [DW_FORM_udata]	(1)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000350:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001d2] = "value")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x03a3 => {0x000003a3} "ManuallyDrop<alloc::collections::btree::node::BoxedNode<(), ()>>")
                        DW_AT_alignment [DW_FORM_udata]	(4)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x0000035b:           DW_TAG_template_type_parameter [8]  
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x01c2 => {0x000001c2} "BoxedNode<(), ()>")
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x00000364:           NULL

0x00000365:         NULL

0x00000366:       DW_TAG_namespace [5] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001d8] = "manually_drop")

0x0000036b:         DW_TAG_structure_type [6] *
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001ea] = "ManuallyDrop<u16>")
                      DW_AT_byte_size [DW_FORM_data1]	(0x02)
                      DW_AT_alignment [DW_FORM_udata]	(2)

0x00000372:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001d2] = "value")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x0508 => {0x00000508} "u16")
                        DW_AT_alignment [DW_FORM_udata]	(2)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x0000037d:           DW_TAG_template_type_parameter [8]  
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x0508 => {0x00000508} "u16")
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x00000386:           NULL

0x00000387:         DW_TAG_structure_type [6] *
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000212] = "ManuallyDrop<()>")
                      DW_AT_byte_size [DW_FORM_data1]	(0x00)
                      DW_AT_alignment [DW_FORM_udata]	(1)

0x0000038e:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001d2] = "value")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                        DW_AT_alignment [DW_FORM_udata]	(1)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000399:           DW_TAG_template_type_parameter [8]  
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x04dd => {0x000004dd} "()")
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x000003a2:           NULL

0x000003a3:         DW_TAG_structure_type [6] *
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000032b] = "ManuallyDrop<alloc::collections::btree::node::BoxedNode<(), ()>>")
                      DW_AT_byte_size [DW_FORM_data1]	(0x04)
                      DW_AT_alignment [DW_FORM_udata]	(4)

0x000003aa:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000001d2] = "value")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x01c2 => {0x000001c2} "BoxedNode<(), ()>")
                        DW_AT_alignment [DW_FORM_udata]	(4)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x000003b5:           DW_TAG_template_type_parameter [8]  
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x01c2 => {0x000001c2} "BoxedNode<(), ()>")
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x000003be:           NULL

0x000003bf:         NULL

0x000003c0:       NULL

0x000003c1:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000477] = "num")

0x000003c6:       DW_TAG_structure_type [6] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000047f] = "NonZeroUsize")
                    DW_AT_byte_size [DW_FORM_data1]	(0x04)
                    DW_AT_alignment [DW_FORM_udata]	(4)

0x000003cd:         DW_TAG_member [7]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000047b] = "__0")
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x0491 => {0x00000491} "usize")
                      DW_AT_alignment [DW_FORM_udata]	(4)
                      DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x000003d8:         NULL

0x000003d9:       NULL

0x000003da:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x000004c1] = "str")

0x000003df:       DW_TAG_structure_type [6] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x000004f7] = "Utf8Error")
                    DW_AT_byte_size [DW_FORM_data1]	(0x08)
                    DW_AT_alignment [DW_FORM_udata]	(4)

0x000003e6:         DW_TAG_member [7]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000004c5] = "valid_up_to")
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x0491 => {0x00000491} "usize")
                      DW_AT_alignment [DW_FORM_udata]	(4)
                      DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x000003f1:         DW_TAG_member [7]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000004d1] = "error_len")
                      DW_AT_type [DW_FORM_ref4]	(cu + 0x0403 => {0x00000403} "Option<u8>")
                      DW_AT_alignment [DW_FORM_udata]	(1)
                      DW_AT_data_member_location [DW_FORM_data1]	(0x04)

0x000003fc:         NULL

0x000003fd:       NULL

0x000003fe:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x000004db] = "option")

0x00000403:       DW_TAG_structure_type [6] *
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x000004ec] = "Option<u8>")
                    DW_AT_byte_size [DW_FORM_data1]	(0x02)
                    DW_AT_alignment [DW_FORM_udata]	(1)

0x0000040a:         DW_TAG_variant_part [14] *
                      DW_AT_discr [DW_FORM_ref4]	(cu + 0x040f => {0x0000040f})

0x0000040f:           DW_TAG_member [15]  
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x048a => {0x0000048a} "u8")
                        DW_AT_alignment [DW_FORM_udata]	(1)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x00)
                        DW_AT_artificial [DW_FORM_flag_present]	(true)

0x00000416:           DW_TAG_variant [16] *
                        DW_AT_discr_value [DW_FORM_data1]	(0x00)

0x00000418:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x000004e2] = "None")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x0433 => {0x00000433} "None")
                          DW_AT_alignment [DW_FORM_udata]	(1)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000423:             NULL

0x00000424:           DW_TAG_variant [16] *
                        DW_AT_discr_value [DW_FORM_data1]	(0x01)

0x00000426:             DW_TAG_member [7]  
                          DW_AT_name [DW_FORM_strp]	( .debug_str[0x000004e7] = "Some")
                          DW_AT_type [DW_FORM_ref4]	(cu + 0x0444 => {0x00000444} "Some")
                          DW_AT_alignment [DW_FORM_udata]	(1)
                          DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00000431:             NULL

0x00000432:           NULL

0x00000433:         DW_TAG_structure_type [6] *
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000004e2] = "None")
                      DW_AT_byte_size [DW_FORM_data1]	(0x02)
                      DW_AT_alignment [DW_FORM_udata]	(1)

0x0000043a:           DW_TAG_template_type_parameter [8]  
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x048a => {0x0000048a} "u8")
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x00000443:           NULL

0x00000444:         DW_TAG_structure_type [6] *
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x000004e7] = "Some")
                      DW_AT_byte_size [DW_FORM_data1]	(0x02)
                      DW_AT_alignment [DW_FORM_udata]	(1)

0x0000044b:           DW_TAG_member [7]  
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000047b] = "__0")
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x048a => {0x0000048a} "u8")
                        DW_AT_alignment [DW_FORM_udata]	(1)
                        DW_AT_data_member_location [DW_FORM_data1]	(0x01)

0x00000456:           DW_TAG_template_type_parameter [8]  
                        DW_AT_type [DW_FORM_ref4]	(cu + 0x048a => {0x0000048a} "u8")
                        DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000d6] = "T")

0x0000045f:           NULL

0x00000460:         NULL

0x00000461:       NULL

0x00000462:     DW_TAG_namespace [5] *
                  DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000517] = "result")

0x00000467:       DW_TAG_enumeration_type [11] *
                    DW_AT_type [DW_FORM_ref4]	(cu + 0x048a => {0x0000048a} "u8")
                    DW_AT_enum_class [DW_FORM_flag_present]	(true)
                    DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000525] = "Result")
                    DW_AT_byte_size [DW_FORM_data1]	(0x01)
                    DW_AT_alignment [DW_FORM_udata]	(1)

0x00000472:         DW_TAG_enumerator [12]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000051e] = "Ok")
                      DW_AT_const_value [DW_FORM_udata]	(0)

0x00000478:         DW_TAG_enumerator [12]  
                      DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000521] = "Err")
                      DW_AT_const_value [DW_FORM_udata]	(1)

0x0000047e:         NULL

0x0000047f:       NULL

0x00000480:     NULL

0x00000481:   DW_TAG_pointer_type [4]  
                DW_AT_type [DW_FORM_ref4]	(cu + 0x048a => {0x0000048a} "u8")
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000bd] = "*const u8")

0x0000048a:   DW_TAG_base_type [17]  
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000ba] = "u8")
                DW_AT_encoding [DW_FORM_data1]	(DW_ATE_unsigned)
                DW_AT_byte_size [DW_FORM_data1]	(0x01)

0x00000491:   DW_TAG_base_type [17]  
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x000000f7] = "usize")
                DW_AT_encoding [DW_FORM_data1]	(DW_ATE_unsigned)
                DW_AT_byte_size [DW_FORM_data1]	(0x04)

0x00000498:   DW_TAG_variable [2]  
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000007e] = "vtable")
                DW_AT_type [DW_FORM_ref4]	(cu + 0x04a1 => {0x000004a1} "vtable")

0x000004a1:   DW_TAG_structure_type [3]  
                DW_AT_containing_type [DW_FORM_ref4]	(cu + 0x04ac => {0x000004ac})
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000007e] = "vtable")
                DW_AT_byte_size [DW_FORM_data1]	(0x00)
                DW_AT_alignment [DW_FORM_udata]	(4)

0x000004ac:   DW_TAG_pointer_type [4]  
                DW_AT_type [DW_FORM_ref4]	(cu + 0x048a => {0x0000048a} "u8")
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x00000157] = "&u8")

0x000004b5:   DW_TAG_variable [2]  
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000007e] = "vtable")
                DW_AT_type [DW_FORM_ref4]	(cu + 0x04be => {0x000004be} "vtable")

0x000004be:   DW_TAG_structure_type [3]  
                DW_AT_containing_type [DW_FORM_ref4]	(cu + 0x0277 => {0x00000277})
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000007e] = "vtable")
                DW_AT_byte_size [DW_FORM_data1]	(0x00)
                DW_AT_alignment [DW_FORM_udata]	(4)

0x000004c9:   DW_TAG_variable [2]  
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000007e] = "vtable")
                DW_AT_type [DW_FORM_ref4]	(cu + 0x04d2 => {0x000004d2} "vtable")

0x000004d2:   DW_TAG_structure_type [3]  
                DW_AT_containing_type [DW_FORM_ref4]	(cu + 0x02b4 => {0x000002b4})
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000007e] = "vtable")
                DW_AT_byte_size [DW_FORM_data1]	(0x00)
                DW_AT_alignment [DW_FORM_udata]	(4)

0x000004dd:   DW_TAG_base_type [17]  
                DW_AT_name [DW_FORM_strp]	( .debug_str[0x0000016d] = "()")
                DW_AT_encoding [DW_FORM_data1]	(DW_ATE_unsigned)
                DW_AT_byte_size [DW_FORM_data1]	(0x00)

0x000004e4:   DW_TAG_variable [2]  
